performance/axis2/data/echoDoubles-100.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:echoDoubles xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input>0.0</ns1:input><ns1:input>1.0</ns1:input><ns1:input>2.0</ns1:input><ns1:input>3.0</ns1:input><ns1:input>4.0</ns1:input><ns1:input>5.0</ns1:input><ns1:input>6.0</ns1:input><ns1:input>7.0</ns1:input><ns1:input>8.0</ns1:input><ns1:input>9.0</ns1:input><ns1:input>10.0</ns1:input><ns1:input>11.0</ns1:input><ns1:input>12.0</ns1:input><ns1:input>13.0</ns1:input><ns1:input>14.0</ns1:input><ns1:input>15.0</ns1:input><ns1:input>16.0</ns1:input><ns1:input>17.0</ns1:input><ns1:input>18.0</ns1:input><ns1:input>19.0</ns1:input><ns1:input>20.0</ns1:input><ns1:input>21.0</ns1:input><ns1:input>22.0</ns1:input><ns1:input>23.0</ns1:input><ns1:input>24.0</ns1:input><ns1:input>25.0</ns1:input><ns1:input>26.0</ns1:input><ns1:input>27.0</ns1:input><ns1:input>28.0</ns1:input><ns1:input>29.0</ns1:input><ns1:input>30.0</ns1:input><ns1:input>31.0</ns1:input><ns1:input>32.0</ns1:input><ns1:input>33.0</ns1:input><ns1:input>34.0</ns1:input><ns1:input>35.0</ns1:input><ns1:input>36.0</ns1:input><ns1:input>37.0</ns1:input><ns1:input>38.0</ns1:input><ns1:input>39.0</ns1:input><ns1:input>40.0</ns1:input><ns1:input>41.0</ns1:input><ns1:input>42.0</ns1:input><ns1:input>43.0</ns1:input><ns1:input>44.0</ns1:input><ns1:input>45.0</ns1:input><ns1:input>46.0</ns1:input><ns1:input>47.0</ns1:input><ns1:input>48.0</ns1:input><ns1:input>49.0</ns1:input><ns1:input>50.0</ns1:input><ns1:input>51.0</ns1:input><ns1:input>52.0</ns1:input><ns1:input>53.0</ns1:input><ns1:input>54.0</ns1:input><ns1:input>55.0</ns1:input><ns1:input>56.0</ns1:input><ns1:input>57.0</ns1:input><ns1:input>58.0</ns1:input><ns1:input>59.0</ns1:input><ns1:input>60.0</ns1:input><ns1:input>61.0</ns1:input><ns1:input>62.0</ns1:input><ns1:input>63.0</ns1:input><ns1:input>64.0</ns1:input><ns1:input>65.0</ns1:input><ns1:input>66.0</ns1:input><ns1:input>67.0</ns1:input><ns1:input>68.0</ns1:input><ns1:input>69.0</ns1:input><ns1:input>70.0</ns1:input><ns1:input>71.0</ns1:input><ns1:input>72.0</ns1:input><ns1:input>73.0</ns1:input><ns1:input>74.0</ns1:input><ns1:input>75.0</ns1:input><ns1:input>76.0</ns1:input><ns1:input>77.0</ns1:input><ns1:input>78.0</ns1:input><ns1:input>79.0</ns1:input><ns1:input>80.0</ns1:input><ns1:input>81.0</ns1:input><ns1:input>82.0</ns1:input><ns1:input>83.0</ns1:input><ns1:input>84.0</ns1:input><ns1:input>85.0</ns1:input><ns1:input>86.0</ns1:input><ns1:input>87.0</ns1:input><ns1:input>88.0</ns1:input><ns1:input>89.0</ns1:input><ns1:input>90.0</ns1:input><ns1:input>91.0</ns1:input><ns1:input>92.0</ns1:input><ns1:input>93.0</ns1:input><ns1:input>94.0</ns1:input><ns1:input>95.0</ns1:input><ns1:input>96.0</ns1:input><ns1:input>97.0</ns1:input><ns1:input>98.0</ns1:input><ns1:input>99.0</ns1:input></ns1:echoDoubles></soapenv:Body></soapenv:Envelope>