performance/axis2/data/receiveStrings-100.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:receiveStrings xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input>s0</ns1:input><ns1:input>s1</ns1:input><ns1:input>s2</ns1:input><ns1:input>s3</ns1:input><ns1:input>s4</ns1:input><ns1:input>s5</ns1:input><ns1:input>s6</ns1:input><ns1:input>s7</ns1:input><ns1:input>s8</ns1:input><ns1:input>s9</ns1:input><ns1:input>s10</ns1:input><ns1:input>s11</ns1:input><ns1:input>s12</ns1:input><ns1:input>s13</ns1:input><ns1:input>s14</ns1:input><ns1:input>s15</ns1:input><ns1:input>s16</ns1:input><ns1:input>s17</ns1:input><ns1:input>s18</ns1:input><ns1:input>s19</ns1:input><ns1:input>s20</ns1:input><ns1:input>s21</ns1:input><ns1:input>s22</ns1:input><ns1:input>s23</ns1:input><ns1:input>s24</ns1:input><ns1:input>s25</ns1:input><ns1:input>s26</ns1:input><ns1:input>s27</ns1:input><ns1:input>s28</ns1:input><ns1:input>s29</ns1:input><ns1:input>s30</ns1:input><ns1:input>s31</ns1:input><ns1:input>s32</ns1:input><ns1:input>s33</ns1:input><ns1:input>s34</ns1:input><ns1:input>s35</ns1:input><ns1:input>s36</ns1:input><ns1:input>s37</ns1:input><ns1:input>s38</ns1:input><ns1:input>s39</ns1:input><ns1:input>s40</ns1:input><ns1:input>s41</ns1:input><ns1:input>s42</ns1:input><ns1:input>s43</ns1:input><ns1:input>s44</ns1:input><ns1:input>s45</ns1:input><ns1:input>s46</ns1:input><ns1:input>s47</ns1:input><ns1:input>s48</ns1:input><ns1:input>s49</ns1:input><ns1:input>s50</ns1:input><ns1:input>s51</ns1:input><ns1:input>s52</ns1:input><ns1:input>s53</ns1:input><ns1:input>s54</ns1:input><ns1:input>s55</ns1:input><ns1:input>s56</ns1:input><ns1:input>s57</ns1:input><ns1:input>s58</ns1:input><ns1:input>s59</ns1:input><ns1:input>s60</ns1:input><ns1:input>s61</ns1:input><ns1:input>s62</ns1:input><ns1:input>s63</ns1:input><ns1:input>s64</ns1:input><ns1:input>s65</ns1:input><ns1:input>s66</ns1:input><ns1:input>s67</ns1:input><ns1:input>s68</ns1:input><ns1:input>s69</ns1:input><ns1:input>s70</ns1:input><ns1:input>s71</ns1:input><ns1:input>s72</ns1:input><ns1:input>s73</ns1:input><ns1:input>s74</ns1:input><ns1:input>s75</ns1:input><ns1:input>s76</ns1:input><ns1:input>s77</ns1:input><ns1:input>s78</ns1:input><ns1:input>s79</ns1:input><ns1:input>s80</ns1:input><ns1:input>s81</ns1:input><ns1:input>s82</ns1:input><ns1:input>s83</ns1:input><ns1:input>s84</ns1:input><ns1:input>s85</ns1:input><ns1:input>s86</ns1:input><ns1:input>s87</ns1:input><ns1:input>s88</ns1:input><ns1:input>s89</ns1:input><ns1:input>s90</ns1:input><ns1:input>s91</ns1:input><ns1:input>s92</ns1:input><ns1:input>s93</ns1:input><ns1:input>s94</ns1:input><ns1:input>s95</ns1:input><ns1:input>s96</ns1:input><ns1:input>s97</ns1:input><ns1:input>s98</ns1:input><ns1:input>s99</ns1:input></ns1:receiveStrings></soapenv:Body></soapenv:Envelope>