performance/axis2/data/sendBase64-50000.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:sendBase64 xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:size>50000</ns1:size></ns1:sendBase64></soapenv:Body></soapenv:Envelope>