performance/axis2/data/receiveBase64-100.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:receiveBase64 xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input>AAECAwQFBgcICQoLDA0ODxAREhMUFRYXGBkaGxwdHh8gISIjJCUmJygpKissLS4vMDEyMzQ1Njc4OTo7PD0+P0BBQkNERUZHSElKS0xNTk9QUVJTVFVWV1hZWltcXV5fYGFiYw==</ns1:input></ns1:receiveBase64></soapenv:Body></soapenv:Envelope>