performance/axis2/data/echoInts-50.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:echoInts xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input>0</ns1:input><ns1:input>1</ns1:input><ns1:input>2</ns1:input><ns1:input>3</ns1:input><ns1:input>4</ns1:input><ns1:input>5</ns1:input><ns1:input>6</ns1:input><ns1:input>7</ns1:input><ns1:input>8</ns1:input><ns1:input>9</ns1:input><ns1:input>10</ns1:input><ns1:input>11</ns1:input><ns1:input>12</ns1:input><ns1:input>13</ns1:input><ns1:input>14</ns1:input><ns1:input>15</ns1:input><ns1:input>16</ns1:input><ns1:input>17</ns1:input><ns1:input>18</ns1:input><ns1:input>19</ns1:input><ns1:input>20</ns1:input><ns1:input>21</ns1:input><ns1:input>22</ns1:input><ns1:input>23</ns1:input><ns1:input>24</ns1:input><ns1:input>25</ns1:input><ns1:input>26</ns1:input><ns1:input>27</ns1:input><ns1:input>28</ns1:input><ns1:input>29</ns1:input><ns1:input>30</ns1:input><ns1:input>31</ns1:input><ns1:input>32</ns1:input><ns1:input>33</ns1:input><ns1:input>34</ns1:input><ns1:input>35</ns1:input><ns1:input>36</ns1:input><ns1:input>37</ns1:input><ns1:input>38</ns1:input><ns1:input>39</ns1:input><ns1:input>40</ns1:input><ns1:input>41</ns1:input><ns1:input>42</ns1:input><ns1:input>43</ns1:input><ns1:input>44</ns1:input><ns1:input>45</ns1:input><ns1:input>46</ns1:input><ns1:input>47</ns1:input><ns1:input>48</ns1:input><ns1:input>49</ns1:input></ns1:echoInts></soapenv:Body></soapenv:Envelope>