performance/axis2/data/sendInts-30000.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:sendInts xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:size>30000</ns1:size></ns1:sendInts></soapenv:Body></soapenv:Envelope>