performance/axis2/data/receiveDoubles-10.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:receiveDoubles xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input>0.0</ns1:input><ns1:input>1.0</ns1:input><ns1:input>2.0</ns1:input><ns1:input>3.0</ns1:input><ns1:input>4.0</ns1:input><ns1:input>5.0</ns1:input><ns1:input>6.0</ns1:input><ns1:input>7.0</ns1:input><ns1:input>8.0</ns1:input><ns1:input>9.0</ns1:input></ns1:receiveDoubles></soapenv:Body></soapenv:Envelope>