performance/axis2/data/receiveStrings-50.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:receiveStrings xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input>s0</ns1:input><ns1:input>s1</ns1:input><ns1:input>s2</ns1:input><ns1:input>s3</ns1:input><ns1:input>s4</ns1:input><ns1:input>s5</ns1:input><ns1:input>s6</ns1:input><ns1:input>s7</ns1:input><ns1:input>s8</ns1:input><ns1:input>s9</ns1:input><ns1:input>s10</ns1:input><ns1:input>s11</ns1:input><ns1:input>s12</ns1:input><ns1:input>s13</ns1:input><ns1:input>s14</ns1:input><ns1:input>s15</ns1:input><ns1:input>s16</ns1:input><ns1:input>s17</ns1:input><ns1:input>s18</ns1:input><ns1:input>s19</ns1:input><ns1:input>s20</ns1:input><ns1:input>s21</ns1:input><ns1:input>s22</ns1:input><ns1:input>s23</ns1:input><ns1:input>s24</ns1:input><ns1:input>s25</ns1:input><ns1:input>s26</ns1:input><ns1:input>s27</ns1:input><ns1:input>s28</ns1:input><ns1:input>s29</ns1:input><ns1:input>s30</ns1:input><ns1:input>s31</ns1:input><ns1:input>s32</ns1:input><ns1:input>s33</ns1:input><ns1:input>s34</ns1:input><ns1:input>s35</ns1:input><ns1:input>s36</ns1:input><ns1:input>s37</ns1:input><ns1:input>s38</ns1:input><ns1:input>s39</ns1:input><ns1:input>s40</ns1:input><ns1:input>s41</ns1:input><ns1:input>s42</ns1:input><ns1:input>s43</ns1:input><ns1:input>s44</ns1:input><ns1:input>s45</ns1:input><ns1:input>s46</ns1:input><ns1:input>s47</ns1:input><ns1:input>s48</ns1:input><ns1:input>s49</ns1:input></ns1:receiveStrings></soapenv:Body></soapenv:Envelope>