performance/axis2/data/echoStrings-10.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:echoStrings xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input>s0</ns1:input><ns1:input>s1</ns1:input><ns1:input>s2</ns1:input><ns1:input>s3</ns1:input><ns1:input>s4</ns1:input><ns1:input>s5</ns1:input><ns1:input>s6</ns1:input><ns1:input>s7</ns1:input><ns1:input>s8</ns1:input><ns1:input>s9</ns1:input></ns1:echoStrings></soapenv:Body></soapenv:Envelope>